// 7.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(NULL, "rus");
	int N = 0, A = 0, k = 1;
	cout << "Введите длинну и ширину массива:";
	cin >> N >> A;
	int** mas = new int* [N];
	for (int i = 0; i < N; i++)
	{
		mas[i] = new int[A];
	}
	cout << "Вводите значения элементов через Enter:\n";
	for (int i = 0; i < N; i++)
	{
		for (int j = 0; j < A; j++)
		{
			cin >> mas[i][j];
			k *= mas[i][j];
		}
	}
	cout << "Массив:";
	for (int i = 0; i < N; i++)
	{
		cout << "\n";
		for (int j = 0; j < A; j++)
		{
			cout << mas[i][j] << " ";
		}
	}
	cout << "Произведение всех элементов =" << k << "\n";
	if ((k > 99 && k < 1000) || (k < -99 && k > -1000)) cout << "Произведение всех чисел является трёхзначным числом!\n";
	else cout << "Произведение всех чисел не является трёхзначным числом!\n";
	delete[] mas;
	system("pause");
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
